dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCan_reg.h
/** \brief 248, Transmitter Delay Compensation Register 0 */
#define CAN0_N0_TDCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0208248u)
/** Alias (User Manual Name) for CAN0_N0_TDCR.
* To use register names with standard convension, please use CAN0_N0_TDCR.
*/
#define CAN0_TDCR0 (CAN0_N0_TDCR)

/** \brief 250, Interrupt Register 0 */
#define CAN0_N0_IR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IR*)0xF0208250u)
/** Alias (User Manual Name) for CAN0_N0_IR.
* To use register names with standard convension, please use CAN0_N0_IR.
*/
#define CAN0_IR0 (CAN0_N0_IR)

/** \brief 254, Interrupt Enable 0 */
#define CAN0_N0_IE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IE*)0xF0208254u)
/** Alias (User Manual Name) for CAN0_N0_IE.
* To use register names with standard convension, please use CAN0_N0_IE.
*/
#define CAN0_IE0 (CAN0_N0_IE)

/** \brief 280, Global Filter Configuration 0 */
#define CAN0_N0_GFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0208280u)
/** Alias (User Manual Name) for CAN0_N0_GFC.
* To use register names with standard convension, please use CAN0_N0_GFC.
*/
#define CAN0_GFC0 (CAN0_N0_GFC)

/** \brief 284, Standard ID Filter Configuration 0 */
#define CAN0_N0_SIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_SIDFC*)0xF0208284u)
/** Alias (User Manual Name) for CAN0_N0_SIDFC.
* To use register names with standard convension, please use CAN0_N0_SIDFC.
*/
#define CAN0_SIDFC0 (CAN0_N0_SIDFC)

/** \brief 288, Extended ID Filter Configuration 0 */
#define CAN0_N0_XIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDFC*)0xF0208288u)
/** Alias (User Manual Name) for CAN0_N0_XIDFC.
* To use register names with standard convension, please use CAN0_N0_XIDFC.
*/
#define CAN0_XIDFC0 (CAN0_N0_XIDFC)

/** \brief 290, Extended ID AND Mask 0 */
#define CAN0_N0_XIDAM /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDAM*)0xF0208290u)
/** Alias (User Manual Name) for CAN0_N0_XIDAM.
* To use register names with standard convension, please use CAN0_N0_XIDAM.
*/
#define CAN0_XIDAM0 (CAN0_N0_XIDAM)

/** \brief 294, High Priority Message Status 0 */
#define CAN0_N0_HPMS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_HPMS*)0xF0208294u)
/** Alias (User Manual Name) for CAN0_N0_HPMS.
* To use register names with standard convension, please use CAN0_N0_HPMS.
*/
#define CAN0_HPMS0 (CAN0_N0_HPMS)

/** \brief 298, New Data 1 0 */
#define CAN0_N0_NDAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT1*)0xF0208298u)
/** Alias (User Manual Name) for CAN0_N0_NDAT1.
* To use register names with standard convension, please use CAN0_N0_NDAT1.
*/
#define CAN0_NDAT10 (CAN0_N0_NDAT1)

/** \brief 29C, New Data 2 0 */
#define CAN0_N0_NDAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT2*)0xF020829Cu)
/** Alias (User Manual Name) for CAN0_N0_NDAT2.
* To use register names with standard convension, please use CAN0_N0_NDAT2.
*/
#define CAN0_NDAT20 (CAN0_N0_NDAT2)

/** \brief 2A0, Rx FIFO 0 Configuration 0 */
#define CAN0_N0_RX_F0C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0C*)0xF02082A0u)
/** Alias (User Manual Name) for CAN0_N0_RX_F0C.
* To use register names with standard convension, please use CAN0_N0_RX_F0C.
*/
#define CAN0_RXF0C0 (CAN0_N0_RX_F0C)

/** \brief 2A4, Rx FIFO 0 Status 0 */
#define CAN0_N0_RX_F0S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0S*)0xF02082A4u)
/** Alias (User Manual Name) for CAN0_N0_RX_F0S.
* To use register names with standard convension, please use CAN0_N0_RX_F0S.
*/
#define CAN0_RXF0S0 (CAN0_N0_RX_F0S)

/** \brief 2A8, Rx FIFO 0 Acknowledge 0 */
#define CAN0_N0_RX_F0A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0A*)0xF02082A8u)
/** Alias (User Manual Name) for CAN0_N0_RX_F0A.
* To use register names with standard convension, please use CAN0_N0_RX_F0A.
*/
#define CAN0_RXF0A0 (CAN0_N0_RX_F0A)

/** \brief 2AC, Rx Buffer Configuration 0 */
#define CAN0_N0_RX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_BC*)0xF02082ACu)
/** Alias (User Manual Name) for CAN0_N0_RX_BC.
* To use register names with standard convension, please use CAN0_N0_RX_BC.
*/
#define CAN0_RXBC0 (CAN0_N0_RX_BC)

/** \brief 2B0, Rx FIFO 1 Configuration 0 */
#define CAN0_N0_RX_F1C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1C*)0xF02082B0u)
/** Alias (User Manual Name) for CAN0_N0_RX_F1C.
* To use register names with standard convension, please use CAN0_N0_RX_F1C.
*/
#define CAN0_RXF1C0 (CAN0_N0_RX_F1C)

/** \brief 2B4, Rx FIFO 1 Status 0 */
#define CAN0_N0_RX_F1S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1S*)0xF02082B4u)
/** Alias (User Manual Name) for CAN0_N0_RX_F1S.
* To use register names with standard convension, please use CAN0_N0_RX_F1S.
*/
#define CAN0_RXF1S0 (CAN0_N0_RX_F1S)

/** \brief 2B8, Rx FIFO 1 Acknowledge 0 */
#define CAN0_N0_RX_F1A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1A*)0xF02082B8u)
/** Alias (User Manual Name) for CAN0_N0_RX_F1A.
* To use register names with standard convension, please use CAN0_N0_RX_F1A.
*/
#define CAN0_RXF1A0 (CAN0_N0_RX_F1A)

/** \brief 2BC, Rx Buffer/FIFO Element Size Configuration 0 */
#define CAN0_N0_RX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_ESC*)0xF02082BCu)
/** Alias (User Manual Name) for CAN0_N0_RX_ESC.
* To use register names with standard convension, please use CAN0_N0_RX_ESC.
*/
#define CAN0_RXESC0 (CAN0_N0_RX_ESC)

/** \brief 2C0, Tx Buffer Configuration 0 */
#define CAN0_N0_TX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BC*)0xF02082C0u)
/** Alias (User Manual Name) for CAN0_N0_TX_BC.
* To use register names with standard convension, please use CAN0_N0_TX_BC.
*/
#define CAN0_TXBC0 (CAN0_N0_TX_BC)

/** \brief 2C4, Tx FIFO/Queue Status 0 */
#define CAN0_N0_TX_FQS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_FQS*)0xF02082C4u)
/** Alias (User Manual Name) for CAN0_N0_TX_FQS.
* To use register names with standard convension, please use CAN0_N0_TX_FQS.
*/
#define CAN0_TXFQS0 (CAN0_N0_TX_FQS)

/** \brief 2C8, Tx Buffer Element Size Configuration 0 */
#define CAN0_N0_TX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_ESC*)0xF02082C8u)
/** Alias (User Manual Name) for CAN0_N0_TX_ESC.
* To use register names with standard convension, please use CAN0_N0_TX_ESC.
*/
#define CAN0_TXESC0 (CAN0_N0_TX_ESC)

/** \brief 2CC, Tx Buffer Request Pending 0 */
#define CAN0_N0_TX_BRP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BRP*)0xF02082CCu)
/** Alias (User Manual Name) for CAN0_N0_TX_BRP.
* To use register names with standard convension, please use CAN0_N0_TX_BRP.
*/
#define CAN0_TXBRP0 (CAN0_N0_TX_BRP)

/** \brief 2D0, Tx Buffer Add Request 0 */
#define CAN0_N0_TX_BAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BAR*)0xF02082D0u)
/** Alias (User Manual Name) for CAN0_N0_TX_BAR.
* To use register names with standard convension, please use CAN0_N0_TX_BAR.
*/
#define CAN0_TXBAR0 (CAN0_N0_TX_BAR)

/** \brief 2D4, Tx Buffer Cancellation Request 0 */
#define CAN0_N0_TX_BCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCR*)0xF02082D4u)
/** Alias (User Manual Name) for CAN0_N0_TX_BCR.
* To use register names with standard convension, please use CAN0_N0_TX_BCR.
*/
#define CAN0_TXBCR0 (CAN0_N0_TX_BCR)

/** \brief 2D8, Tx Buffer Transmission Occurred 0 */
#define CAN0_N0_TX_BTO /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTO*)0xF02082D8u)
/** Alias (User Manual Name) for CAN0_N0_TX_BTO.
* To use register names with standard convension, please use CAN0_N0_TX_BTO.
*/
#define CAN0_TXBTO0 (CAN0_N0_TX_BTO)

/** \brief 2DC, Tx Buffer Cancellation Finished 0 */
#define CAN0_N0_TX_BCF /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCF*)0xF02082DCu)
/** Alias (User Manual Name) for CAN0_N0_TX_BCF.
* To use register names with standard convension, please use CAN0_N0_TX_BCF.
*/
#define CAN0_TXBCF0 (CAN0_N0_TX_BCF)

/** \brief 2E0, Tx Buffer Transmission Interrupt Enable 0 */
#define CAN0_N0_TX_BTIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTIE*)0xF02082E0u)
/** Alias (User Manual Name) for CAN0_N0_TX_BTIE.
* To use register names with standard convension, please use CAN0_N0_TX_BTIE.
*/
#define CAN0_TXBTIE0 (CAN0_N0_TX_BTIE)

/** \brief 2E4, Tx Buffer Cancellation Finished Interrupt Enable 0 */
#define CAN0_N0_TX_BCIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCIE*)0xF02082E4u)
/** Alias (User Manual Name) for CAN0_N0_TX_BCIE.
* To use register names with standard convension, please use CAN0_N0_TX_BCIE.
*/
#define CAN0_TXBCIE0 (CAN0_N0_TX_BCIE)

/** \brief 2F0, Tx Event FIFO Configuration 0 */
#define CAN0_N0_TX_EFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFC*)0xF02082F0u)
/** Alias (User Manual Name) for CAN0_N0_TX_EFC.
* To use register names with standard convension, please use CAN0_N0_TX_EFC.
*/
#define CAN0_TXEFC0 (CAN0_N0_TX_EFC)

