dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCan_reg.h
/** \brief 930, Node 2 Timer Receive Timeout Register */
#define CAN2_N2_NT_RTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_RTR*)0xF0228930u)
/** Alias (User Manual Name) for CAN2_N2_NT_RTR.
* To use register names with standard convension, please use CAN2_N2_NT_RTR.
*/
#define CAN2_NTRTR2 (CAN2_N2_NT_RTR)

/** \brief 940, Node 2 Port Control Register */
#define CAN2_N2_NPCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NPCR*)0xF0228940u)
/** Alias (User Manual Name) for CAN2_N2_NPCR.
* To use register names with standard convension, please use CAN2_N2_NPCR.
*/
#define CAN2_NPCR2 (CAN2_N2_NPCR)

/** \brief A00, Core Release Register 2 */
#define CAN2_N2_CREL /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CREL*)0xF0228A00u)
/** Alias (User Manual Name) for CAN2_N2_CREL.
* To use register names with standard convension, please use CAN2_N2_CREL.
*/
#define CAN2_CREL2 (CAN2_N2_CREL)

/** \brief A04, Endian Register 2 */
#define CAN2_N2_ENDN /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDN*)0xF0228A04u)
/** Alias (User Manual Name) for CAN2_N2_ENDN.
* To use register names with standard convension, please use CAN2_N2_ENDN.
*/
#define CAN2_ENDN2 (CAN2_N2_ENDN)

/** \brief A0C, Data Bit Timing & Prescaler Register 2 */
#define CAN2_N2_DBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_DBTP*)0xF0228A0Cu)
/** Alias (User Manual Name) for CAN2_N2_DBTP.
* To use register names with standard convension, please use CAN2_N2_DBTP.
*/
#define CAN2_DBTP2 (CAN2_N2_DBTP)

/** \brief A10, Test Register 2 */
#define CAN2_N2_TEST /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TEST*)0xF0228A10u)
/** Alias (User Manual Name) for CAN2_N2_TEST.
* To use register names with standard convension, please use CAN2_N2_TEST.
*/
#define CAN2_TEST2 (CAN2_N2_TEST)

/** \brief A14, RAM Watchdog 2 */
#define CAN2_N2_RWD /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RWD*)0xF0228A14u)
/** Alias (User Manual Name) for CAN2_N2_RWD.
* To use register names with standard convension, please use CAN2_N2_RWD.
*/
#define CAN2_RWD2 (CAN2_N2_RWD)

/** \brief A18, CC Control Register 2 */
#define CAN2_N2_CCCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CCCR*)0xF0228A18u)
/** Alias (User Manual Name) for CAN2_N2_CCCR.
* To use register names with standard convension, please use CAN2_N2_CCCR.
*/
#define CAN2_CCCR2 (CAN2_N2_CCCR)

/** \brief A1C, Nominal Bit Timing & Prescaler Register 2 */
#define CAN2_N2_NBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NBTP*)0xF0228A1Cu)
/** Alias (User Manual Name) for CAN2_N2_NBTP.
* To use register names with standard convension, please use CAN2_N2_NBTP.
*/
#define CAN2_NBTP2 (CAN2_N2_NBTP)

/** \brief A20, Timestamp Counter Configuration 2 */
#define CAN2_N2_TSCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCC*)0xF0228A20u)
/** Alias (User Manual Name) for CAN2_N2_TSCC.
* To use register names with standard convension, please use CAN2_N2_TSCC.
*/
#define CAN2_TSCC2 (CAN2_N2_TSCC)

/** \brief A24, Timestamp Counter Value 2 */
#define CAN2_N2_TSCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCV*)0xF0228A24u)
/** Alias (User Manual Name) for CAN2_N2_TSCV.
* To use register names with standard convension, please use CAN2_N2_TSCV.
*/
#define CAN2_TSCV2 (CAN2_N2_TSCV)

/** \brief A28, Timeout Counter Configuration 2 */
#define CAN2_N2_TOCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCC*)0xF0228A28u)
/** Alias (User Manual Name) for CAN2_N2_TOCC.
* To use register names with standard convension, please use CAN2_N2_TOCC.
*/
#define CAN2_TOCC2 (CAN2_N2_TOCC)

/** \brief A2C, Timeout Counter Value 2 */
#define CAN2_N2_TOCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCV*)0xF0228A2Cu)
/** Alias (User Manual Name) for CAN2_N2_TOCV.
* To use register names with standard convension, please use CAN2_N2_TOCV.
*/
#define CAN2_TOCV2 (CAN2_N2_TOCV)

/** \brief A40, Error Counter Register 2 */
#define CAN2_N2_ECR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ECR*)0xF0228A40u)
/** Alias (User Manual Name) for CAN2_N2_ECR.
* To use register names with standard convension, please use CAN2_N2_ECR.
*/
#define CAN2_ECR2 (CAN2_N2_ECR)

/** \brief A44, Protocol Status Register 2 */
#define CAN2_N2_PSR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0228A44u)
/** Alias (User Manual Name) for CAN2_N2_PSR.
* To use register names with standard convension, please use CAN2_N2_PSR.
*/
#define CAN2_PSR2 (CAN2_N2_PSR)

/** \brief A48, Transmitter Delay Compensation Register 2 */
#define CAN2_N2_TDCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0228A48u)
/** Alias (User Manual Name) for CAN2_N2_TDCR.
* To use register names with standard convension, please use CAN2_N2_TDCR.
*/
#define CAN2_TDCR2 (CAN2_N2_TDCR)

/** \brief A50, Interrupt Register 2 */
#define CAN2_N2_IR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IR*)0xF0228A50u)
/** Alias (User Manual Name) for CAN2_N2_IR.
* To use register names with standard convension, please use CAN2_N2_IR.
*/
#define CAN2_IR2 (CAN2_N2_IR)

/** \brief A54, Interrupt Enable 2 */
#define CAN2_N2_IE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IE*)0xF0228A54u)
/** Alias (User Manual Name) for CAN2_N2_IE.
* To use register names with standard convension, please use CAN2_N2_IE.
*/
#define CAN2_IE2 (CAN2_N2_IE)

/** \brief A80, Global Filter Configuration 2 */
#define CAN2_N2_GFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0228A80u)
/** Alias (User Manual Name) for CAN2_N2_GFC.
* To use register names with standard convension, please use CAN2_N2_GFC.
*/
#define CAN2_GFC2 (CAN2_N2_GFC)

/** \brief A84, Standard ID Filter Configuration 2 */
#define CAN2_N2_SIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_SIDFC*)0xF0228A84u)
/** Alias (User Manual Name) for CAN2_N2_SIDFC.
* To use register names with standard convension, please use CAN2_N2_SIDFC.
*/
#define CAN2_SIDFC2 (CAN2_N2_SIDFC)

/** \brief A88, Extended ID Filter Configuration 2 */
#define CAN2_N2_XIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDFC*)0xF0228A88u)
/** Alias (User Manual Name) for CAN2_N2_XIDFC.
* To use register names with standard convension, please use CAN2_N2_XIDFC.
*/
#define CAN2_XIDFC2 (CAN2_N2_XIDFC)

/** \brief A90, Extended ID AND Mask 2 */
#define CAN2_N2_XIDAM /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDAM*)0xF0228A90u)
/** Alias (User Manual Name) for CAN2_N2_XIDAM.
* To use register names with standard convension, please use CAN2_N2_XIDAM.
*/
#define CAN2_XIDAM2 (CAN2_N2_XIDAM)

