dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCan_reg.h
/** \brief E18, CC Control Register 3 */
#define CAN2_N3_CCCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CCCR*)0xF0228E18u)
/** Alias (User Manual Name) for CAN2_N3_CCCR.
* To use register names with standard convension, please use CAN2_N3_CCCR.
*/
#define CAN2_CCCR3 (CAN2_N3_CCCR)

/** \brief E1C, Nominal Bit Timing & Prescaler Register 3 */
#define CAN2_N3_NBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NBTP*)0xF0228E1Cu)
/** Alias (User Manual Name) for CAN2_N3_NBTP.
* To use register names with standard convension, please use CAN2_N3_NBTP.
*/
#define CAN2_NBTP3 (CAN2_N3_NBTP)

/** \brief E20, Timestamp Counter Configuration 3 */
#define CAN2_N3_TSCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCC*)0xF0228E20u)
/** Alias (User Manual Name) for CAN2_N3_TSCC.
* To use register names with standard convension, please use CAN2_N3_TSCC.
*/
#define CAN2_TSCC3 (CAN2_N3_TSCC)

/** \brief E24, Timestamp Counter Value 3 */
#define CAN2_N3_TSCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCV*)0xF0228E24u)
/** Alias (User Manual Name) for CAN2_N3_TSCV.
* To use register names with standard convension, please use CAN2_N3_TSCV.
*/
#define CAN2_TSCV3 (CAN2_N3_TSCV)

/** \brief E28, Timeout Counter Configuration 3 */
#define CAN2_N3_TOCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCC*)0xF0228E28u)
/** Alias (User Manual Name) for CAN2_N3_TOCC.
* To use register names with standard convension, please use CAN2_N3_TOCC.
*/
#define CAN2_TOCC3 (CAN2_N3_TOCC)

/** \brief E2C, Timeout Counter Value 3 */
#define CAN2_N3_TOCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCV*)0xF0228E2Cu)
/** Alias (User Manual Name) for CAN2_N3_TOCV.
* To use register names with standard convension, please use CAN2_N3_TOCV.
*/
#define CAN2_TOCV3 (CAN2_N3_TOCV)

/** \brief E40, Error Counter Register 3 */
#define CAN2_N3_ECR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ECR*)0xF0228E40u)
/** Alias (User Manual Name) for CAN2_N3_ECR.
* To use register names with standard convension, please use CAN2_N3_ECR.
*/
#define CAN2_ECR3 (CAN2_N3_ECR)

/** \brief E44, Protocol Status Register 3 */
#define CAN2_N3_PSR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0228E44u)
/** Alias (User Manual Name) for CAN2_N3_PSR.
* To use register names with standard convension, please use CAN2_N3_PSR.
*/
#define CAN2_PSR3 (CAN2_N3_PSR)

/** \brief E48, Transmitter Delay Compensation Register 3 */
#define CAN2_N3_TDCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0228E48u)
/** Alias (User Manual Name) for CAN2_N3_TDCR.
* To use register names with standard convension, please use CAN2_N3_TDCR.
*/
#define CAN2_TDCR3 (CAN2_N3_TDCR)

/** \brief E50, Interrupt Register 3 */
#define CAN2_N3_IR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IR*)0xF0228E50u)
/** Alias (User Manual Name) for CAN2_N3_IR.
* To use register names with standard convension, please use CAN2_N3_IR.
*/
#define CAN2_IR3 (CAN2_N3_IR)

/** \brief E54, Interrupt Enable 3 */
#define CAN2_N3_IE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IE*)0xF0228E54u)
/** Alias (User Manual Name) for CAN2_N3_IE.
* To use register names with standard convension, please use CAN2_N3_IE.
*/
#define CAN2_IE3 (CAN2_N3_IE)

/** \brief E80, Global Filter Configuration 3 */
#define CAN2_N3_GFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0228E80u)
/** Alias (User Manual Name) for CAN2_N3_GFC.
* To use register names with standard convension, please use CAN2_N3_GFC.
*/
#define CAN2_GFC3 (CAN2_N3_GFC)

/** \brief E84, Standard ID Filter Configuration 3 */
#define CAN2_N3_SIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_SIDFC*)0xF0228E84u)
/** Alias (User Manual Name) for CAN2_N3_SIDFC.
* To use register names with standard convension, please use CAN2_N3_SIDFC.
*/
#define CAN2_SIDFC3 (CAN2_N3_SIDFC)

/** \brief E88, Extended ID Filter Configuration 3 */
#define CAN2_N3_XIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDFC*)0xF0228E88u)
/** Alias (User Manual Name) for CAN2_N3_XIDFC.
* To use register names with standard convension, please use CAN2_N3_XIDFC.
*/
#define CAN2_XIDFC3 (CAN2_N3_XIDFC)

/** \brief E90, Extended ID AND Mask 3 */
#define CAN2_N3_XIDAM /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDAM*)0xF0228E90u)
/** Alias (User Manual Name) for CAN2_N3_XIDAM.
* To use register names with standard convension, please use CAN2_N3_XIDAM.
*/
#define CAN2_XIDAM3 (CAN2_N3_XIDAM)

/** \brief E94, High Priority Message Status 3 */
#define CAN2_N3_HPMS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_HPMS*)0xF0228E94u)
/** Alias (User Manual Name) for CAN2_N3_HPMS.
* To use register names with standard convension, please use CAN2_N3_HPMS.
*/
#define CAN2_HPMS3 (CAN2_N3_HPMS)

/** \brief E98, New Data 1 3 */
#define CAN2_N3_NDAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT1*)0xF0228E98u)
/** Alias (User Manual Name) for CAN2_N3_NDAT1.
* To use register names with standard convension, please use CAN2_N3_NDAT1.
*/
#define CAN2_NDAT13 (CAN2_N3_NDAT1)

/** \brief E9C, New Data 2 3 */
#define CAN2_N3_NDAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT2*)0xF0228E9Cu)
/** Alias (User Manual Name) for CAN2_N3_NDAT2.
* To use register names with standard convension, please use CAN2_N3_NDAT2.
*/
#define CAN2_NDAT23 (CAN2_N3_NDAT2)

/** \brief EA0, Rx FIFO 0 Configuration 3 */
#define CAN2_N3_RX_F0C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0C*)0xF0228EA0u)
/** Alias (User Manual Name) for CAN2_N3_RX_F0C.
* To use register names with standard convension, please use CAN2_N3_RX_F0C.
*/
#define CAN2_RXF0C3 (CAN2_N3_RX_F0C)

/** \brief EA4, Rx FIFO 0 Status 3 */
#define CAN2_N3_RX_F0S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0S*)0xF0228EA4u)
/** Alias (User Manual Name) for CAN2_N3_RX_F0S.
* To use register names with standard convension, please use CAN2_N3_RX_F0S.
*/
#define CAN2_RXF0S3 (CAN2_N3_RX_F0S)

/** \brief EA8, Rx FIFO 0 Acknowledge 3 */
#define CAN2_N3_RX_F0A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0A*)0xF0228EA8u)
/** Alias (User Manual Name) for CAN2_N3_RX_F0A.
* To use register names with standard convension, please use CAN2_N3_RX_F0A.
*/
#define CAN2_RXF0A3 (CAN2_N3_RX_F0A)

